app/controllers/articles_controller.rb

  def destroy
    @article = Article.find(params[:id])
    @article.delete
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This was our first article"], ["updated_at", "2020-11-03 15:38:40.091738"], ["id", 1]]